arcticicestudio.nord-visual-studio-code
astro-build.astro-vscode
austenc.tailwind-docs
beardedbear.beardedicons
bmalehorn.print-it
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
earshinov.filter-lines
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
fill-labs.dependi
formulahendry.auto-rename-tag
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
hashicorp.terraform
hoovercj.vscode-settings-cycler
humao.rest-client
jasonnutter.vscode-codeowners
jdinhlife.gruvbox
johnnymorganz.stylua
josemurilloc.aura-spirit-dracula
joshmu.periscope
kahole.magit
malmaud.tmux
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.test-adapter-converter
ms-vscode.vscode-speech
mxsdev.typescript-explorer
patbenatar.advanced-new-file
rangav.vscode-thunder-client
redhat.vscode-yaml
richie5um2.vscode-sort-json
rogalmic.bash-debug
rust-lang.rust-analyzer
sidneys1.gitconfig
sleistner.vscode-fileutils
subframe7536.custom-ui-style
sumneko.lua
tamasfe.even-better-toml
timonwong.shellcheck
tomrijndorp.find-it-faster
unifiedjs.vscode-mdx
usernamehw.errorlens
vadimcn.vscode-lldb
vira.vsc-vira-theme
vitest.explorer
vivaxy.vscode-conventional-commits
vscodevim.vim
vspacecode.whichkey
wayou.vscode-todo-highlight
xadillax.viml
