# NOTE: ruby works in this file, so feel free to use it for conditional logic, etc
# see: https://github.com/Homebrew/homebrew-bundle

# Execute the `hostname` command in a subshell and remove the trailing '\n'
hostname = `hostname`.chomp

########
# TAPS #
########

tap "arl/arl" # for gitmux
tap "candid82/brew" # for joker, for goku
tap "yqrashawn/goku" # for karabiner
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "hashicorp/tap" # for terraform, vault
tap "saulpw/vd" # for visidata

############
# PACKAGES #
############

brew "bat" # replaces cat
brew "btop" # top alternative
brew "commitizen" # for git
brew "coreutils"
brew "ctop" # for docker
brew "eza" # replaces ls
brew "fd" # replaces find; used by yazi
brew "ffmpegthumbnailer" # for yazi
brew "fnm" # replaces nvm
brew "fzf" # awesome; used by yazi
brew "gh"
brew "git"
brew "git-delta" # for git: https://dandavison.github.io/delta/
brew "arl/arl/gitmux" # for tmux
brew "glances" # top alternative
brew "gnu-sed"
brew "go"
brew "yqrashawn/goku/goku" # for karibiner
brew "goose" # for go
brew "hadolint" # for docker
brew "htop" # top alternative
brew "imagemagick" # for kitty's icat image support
brew "jq" # for parsing json; used by yazi
brew "k9s" # for kubernetes
brew "kubectl" # for kubernetes
brew "kubectx" # for kubernetes
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "lua" # for neovim: https://www.lua.org/manual/
brew "luarocks" # lua package manager: https://luarocks.org
brew "mas"
brew "m-cli" # macos CLI: https://github.com/rgcr/m-cli
brew "neovim"
brew "poppler" # for yazi
brew "postgresql@14"
brew "libpq" # for postgres
brew "powerlevel10k"
brew "pyenv" # manages python versions
brew "pyenv-virtualenv" # allow pyenv to manage virtualenvs
brew "ripgrep" # for telescope, yazi
brew "shellcheck" # for bash
brew "speedtest-cli"
brew "starship"
brew "stern" # for kubectl
brew "stylua" # for lua
brew "svn" # for font cask installations
brew "taplo" # for toml
brew "hashicorp/tap/terraform" # for neovim + vs code
brew "tidy-html5" # for linting html + xml in neovim
brew "tmux"
brew "trash"
brew "tree"
brew "unar" # for yazi
brew "vifm"
brew "saulpw/vd/visidata"
brew "wget" # for neovim
brew "yazi" # terminal file manager
brew "zoxide" # for yazi
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

if hostname == "Air"
  brew "gleam"
  brew "zig"
end

if hostname == "MULO-JQ97NW-MBP"
  brew "bazel" # for lowe
  brew "helm" # for kubernetes
  brew "kafka"
  brew "librdkafka" # for kafka
  brew "lzlib"
  brew "opa" # for opa-bundle
  brew "openjdk" # for java
  brew "skaffold"
  brew "tcl-tk"
  brew "redis"
  brew "hashicorp/tap/vault"
  brew "zlib"
end

#########
# FONTS #
#########

# Fonts
# see: https://github.com/Homebrew/homebrew-cask/tree/master/Casks/font
cask "font-symbols-only-nerd-font" # for yazi
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"

################
# APPS (CASKS) #
################

cask "1password-cli"
cask "alfred"
cask "appcleaner"
# NOTE: don't install "docker" cask until Apple Silicon issues resolved
cask "hyperkey"
cask "karabiner-elements"
cask "kitty"
cask "raycast"
cask "rectangle"
cask "visual-studio-code"
cask "vlc"

if hostname == "Air"
  cask "brave-browser"
  cask "firefox"
  cask "google-chrome" # NOTE: work may control this app
  # cask "handbrake"
  # cask "ishowu-instant"
  cask "notion"
  cask "obsidian"
  # cask "prepros" NOTE: manually download v6 instead (just need it for Adam's site)
  cask "runjs"
  # cask "transmit
  cask "zoom" # NOTE: work may control this app
elsif hostname == "Mini"
  cask "backblaze"
  # cask "handbrake"
elsif hostname == "MULO-JQ97NW-MBP"
  cask "brave-browser"
  cask "firefox"
  cask "notion"
  cask "obsidian"
  cask "runjs"
end

########################
# APPS (MAC APP STORE) #
########################

mas "Amphetamine", id: 937984704
mas "Vimari", id: 1480933944

message = "\📦 Loading additional Mac App Store apps for #{hostname}\n"

if hostname == "Air"
  # mas "Bear", id: 1091189122
  # mas "Fantastical - Calendar", id: 975937182
  mas "Keynote", id: 409183694
  mas "Numbers", id: 409203825
  mas "Notion Web Clipper", id: 1559269364 # Safari extension
  mas "Pages", id: 409201541
  # mas "PiPifier", id: 1160374471
  # mas "Pixave", id: 924891282
  # mas "Pixelmator Pro", id: 1289583905
  mas "Reeder 5.", id: 1529448980
  mas "Sip", id: 507257563
  # mas "Smart Converter Pro", id: 450078312
  # mas "Spark", id: 1176895641
  mas "Things 3", id: 904280696
elsif hostname == "Mini"
  # mas "Smart Converter Pro", id: 450078312
elsif hostname == "MULO-JQ97NW-MBP"
  # mas "Bear", id: 1091189122
  # mas "Fantastical - Calendar", id: 975937182
  mas "Keynote", id: 409183694
  mas "Notion Web Clipper", id: 1559269364 # Safari extension
  mas "Numbers", id: 409203825
  mas "Pages", id: 409201541
  # mas "PiPifier", id: 1160374471
  mas "Reeder 5.", id: 1529448980
  # mas "Spark", id: 1176895641
end

###########
# VS CODE #
###########

vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.vscode-database-client2"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "earshinov.filter-lines"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "ginfuru.better-nunjucks"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-settings-cycler"
vscode "jdinhlife.gruvbox"
vscode "johnnymorganz.stylua"
vscode "malmaud.tmux"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "patbenatar.advanced-new-file"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "sidneys1.gitconfig"
vscode "sleistner.vscode-fileutils"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "wooodhead.vscode-wrap-console-log-simple"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"

if hostname == "Air"
  vscode "golang.go"
  vscode "serayuzgur.crates" # for rust
  vscode "vadimcn.vscode-lldb" # for debugging rust, go and other compiled languages
elsif hostname == "MULO-JQ97NW-MBP"
  vscode "editorconfig.editorconfig"
  vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
  vscode "ms-python.black-formatter"
  vscode "ms-python.flake8"
  vscode "ms-python.isort"
  vscode "ms-toolsai.jupyter"
  vscode "ms-toolsai.jupyter-keymap"
  vscode "ms-toolsai.jupyter-renderers"
  vscode "ms-toolsai.vscode-jupyter-cell-tags"
  vscode "ms-toolsai.vscode-jupyter-slideshow"
  vscode "swimm.swimm"
  vscode "tsandall.opa"
end