astro-build.astro-vscode
atomiks.moonlight
austenc.tailwind-docs
bradlc.vscode-tailwindcss
Catppuccin.catppuccin-vsc
cgpanganiban.monokai-winter-night
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
DanielSanMedium.dscodegpt
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
ecmel.vscode-html-css
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
formulahendry.auto-rename-tag
ginfuru.better-nunjucks
GitHub.copilot
GitHub.copilot-chat
github.vscode-github-actions
GitHub.vscode-pull-request-github
hoovercj.vscode-settings-cycler
IronGeek.vscode-env
jdinhlife.gruvbox
malmaud.tmux
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mikestead.dotenv
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
mskelton.one-dark-theme
patbenatar.advanced-new-file
Prisma.prisma
qufiwefefwoyn.kanagawa
rangav.vscode-thunder-client
redhat.vscode-yaml
richie5um2.vscode-sort-json
rocketseat.theme-omni
sidneys1.gitconfig
sleistner.vscode-fileutils
sumneko.lua
tamasfe.even-better-toml
unifiedjs.vscode-mdx
usernamehw.errorlens
vivaxy.vscode-conventional-commits
vscodevim.vim
VSpaceCode.whichkey
wayou.vscode-todo-highlight
wicked-labs.wvsc-serendipity
wooodhead.vscode-wrap-console-log-simple
XadillaX.viml
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
