# NOTE: ruby works in this file, so feel free to use it for conditional logic, etc
# see: https://github.com/Homebrew/homebrew-bundle

# Execute the `networksetup` command in a subshell and remove the trailing '\n'
computer_name = `networksetup -getcomputername`.chomp

cask "visual-studio-code"

vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "BeardedBear.beardedicons"
vscode "bmalehorn.print-it"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.vscode-database-client2"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "earshinov.filter-lines"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-settings-cycler"
vscode "humao.rest-client" # alternative to thunder client
vscode "ive.halftone-theme"
vscode "jasonnutter.vscode-codeowners"
vscode "jdinhlife.gruvbox"
vscode "johnnymorganz.stylua"
vscode "JoseMurilloc.aura-spirit-dracula"
vscode "JoshMu.periscope"
vscode "kahole.magit"
vscode "malmaud.tmux"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "patbenatar.advanced-new-file"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "sidneys1.gitconfig"
vscode "sleistner.vscode-fileutils"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "xadillax.viml"

if computer_name == "Air"
  vscode "denoland.vscode-deno" # for deno
  vscode "golang.go"
  vscode "vadimcn.vscode-lldb" # for debugging rust, go and other compiled languages
end

if computer_name == "7385-Y3FH97X-MAC" || computer_name == "MULO-JQ97NW-MBP"
  vscode "editorconfig.editorconfig"
  vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
  vscode "ms-python.black-formatter"
  vscode "ms-python.flake8"
  vscode "ms-python.isort"
  vscode "swimm.swimm"
  vscode "tsandall.opa"
end
