# taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "schniz/tap"

# packages
brew "bat"
brew "exa"
brew "fzf"
brew "gh"
# brew "git"
brew "lazygit"
brew "mas"
brew "neovim"
# brew "python"
brew "ranger"
brew "ripgrep"
brew "schniz/tap/fnm"
brew "shellcheck"
brew "speedtest-cli"
brew "svn"            # required for font cask installations
brew "tmux"
brew "vifm"
# brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# brew=(
#   ffmpeg
#   python@3.8
# )
# brew "cloc"
# brew "diff-so-fancy"
# brew "entr"
# brew "fd"
# brew "gnupg"
# brew "grep"
# brew "highlight"
# brew "htop"
# brew "jq"
# brew "lazydocker"
# brew "markdown"
# brew "neofetch"
# brew "noti"
# brew "shellcheck"
# brew "trash"
# brew "tree"
# brew "vim"
# brew "wdiff"
# brew "wget"
# brew "z"

# Applications
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "backblaze"
cask "catch"
cask "cheatsheet"
cask "daisydisk"
cask "discord"
cask "drivedx"
cask "gitkraken"
cask "handbrake"
cask "hyper"
cask "ishowu-instant"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "local"
cask "microsoft-teams"
cask "notion"
cask "openvpn-connect"
cask "prepros"
cask "rectangle"
cask "runjs"
cask "sizzy"
cask "skype"
cask "transmit"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zeplin"
cask "zoomus"

# cask "cleanshot"
# cask "vmware-fusion"
# cask "timing"
# cask "choosy"
# cask "soundsource"
# cask "farrago"
# cask "loopback"
# cask "audio-hijack"
# cask "paw"
# cask "postman"
# cask "anybar"
# cask "hazel"
# cask "imageoptim"
# cask "istat-menus"
# cask "textbar"

# Browsers
cask "firefox"
cask "google-chrome"

# Fonts
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"

# macOS App Store
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Contrast", id: 1254981365
mas "DaVinci Resolve", id: 571213070
mas "Disk Care", id: 913724705
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Pixave", id: 924891282
mas "Pixelmator Pro", id: 1289583905
mas "Save to Pocket", id: 1477385213
mas "Slack", id: 803453959
mas "Sip", id: 507257563
mas "Smart Converter Pro", id: 450078312
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696
mas "Vimari", id: 1289583905

# mas "ColorSlurp", id: 1287239339
# mas "Magnet", id: 441258766
# mas "MindNode", id: 1289197285
# mas "FruitJuice", id: 671736912
# mas "Drafts", id: 1435957248
# mas "Logic Pro X", id: 634148309
# mas "Fantastical", id: 975937182
# mas "Xcode", id: 497799835
# mas "Reeder", id: 1449412482
# mas "Deliveries", id: 924726344
# mas "Shush", id: 496437906
# mas "Octotree Pro", id: 1457450145
# mas "Coca", id: 1000808993
# mas "1Blocker", id: 1107421413

