# Don't add work-only packages here! Treat them as one-off installs on my work laptop.

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Packages
brew "bat"
brew "exa"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "arl/arl/gitmux"
brew "gnu-sed"
brew "yqrashawn/goku/goku" # for karibiner
brew "lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "mas"
brew "neovim"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "raycast"
brew "ripgrep" # for telescope
brew "starship"
brew "stylua"
brew "svn" # for font cask installations
brew "tmux"
brew "trash"
brew "vifm"
brew "wget" # for neovim
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps
cask "alfred"
cask "appcleaner"
cask "backblaze"
cask "brave-browser"
cask "cleanmymac"
cask "drivedx"
cask "firefox"
cask "gitkraken"
cask "google-chrome"
# cask "handbrake"
cask "hyperkey"
cask "ishowu-instant"
cask "karabiner-elements"
cask "kitty"
cask "notion"
# cask "prepros" - manually download v6 instead
cask "raycast"
cask "rectangle"
cask "runjs"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wezterm"
cask "zoom"

# Fonts
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"

# macOS App Store
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
# mas "Contrast", id: 1254981365
mas "Fantastical - Calendar", id: 975937182
mas "Keynote", id: 409183694
mas "Notion Web Clipper", id: 1559269364 # Safari extension
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "PiPifier", id: 1160374471
mas "Pixave", id: 924891282
mas "Pixelmator Pro", id: 1289583905
mas "Reeder 5.", id: 1529448980
mas "Sip", id: 507257563
# mas "Smart Converter Pro", id: 450078312
mas "Spark", id: 1176895641
mas "Things 3", id: 904280696
mas "Vimari", id: 1480933944

